MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX250F256L.atdf
      <value-group caption="AN24 Pin Scan Selection bits" name="AD1CSSL__CSSL24">
         <value caption="Select AN24 for input scan; CSSL24 = AN24" name="" value="0x1" />
         <value caption="Skip AN24 for input scan; CSSL24 = AN24" name="" value="0x0" />
      </value-group>
      <value-group caption="AN25 Pin Scan Selection bits" name="AD1CSSL__CSSL25">
         <value caption="Select AN25 for input scan; CSSL25 = AN25" name="" value="0x1" />
         <value caption="Skip AN25 for input scan; CSSL25 = AN25" name="" value="0x0" />
      </value-group>
      <value-group caption="AN26 Pin Scan Selection bits" name="AD1CSSL__CSSL26">
         <value caption="Select AN26 for input scan; CSSL26 = AN26" name="" value="0x1" />
         <value caption="Skip AN26 for input scan; CSSL26 = AN26" name="" value="0x0" />
      </value-group>
      <value-group caption="AN27 Pin Scan Selection bits" name="AD1CSSL__CSSL27">
         <value caption="Select AN27 for input scan; CSSL27 = AN27" name="" value="0x1" />
         <value caption="Skip AN27 for input scan; CSSL27 = AN27" name="" value="0x0" />
      </value-group>
      <value-group caption="AN28 Pin Scan Selection bits" name="AD1CSSL__CSSL28">
         <value caption="Select AN28 for input scan; CSSL28 = AN28" name="" value="0x1" />
         <value caption="Skip AN28 for input scan; CSSL28 = AN28" name="" value="0x0" />
      </value-group>
      <value-group caption="AN29 Pin Scan Selection bits" name="AD1CSSL__CSSL29">
         <value caption="Select AN29 for input scan; CSSL29 = AN29" name="" value="0x1" />
         <value caption="Skip AN29 for input scan; CSSL29 = AN29" name="" value="0x0" />
      </value-group>
      <value-group caption="AN30 Pin Scan Selection bits" name="AD1CSSL__CSSL30">
         <value caption="Select AN30 for input scan; CSSL30 = AN30" name="" value="0x1" />
         <value caption="Skip AN30 for input scan; CSSL30 = AN30" name="" value="0x0" />
      </value-group>
      <value-group caption="AN31 Pin Scan Selection bits" name="AD1CSSL__CSSL31">
         <value caption="Select AN31 for input scan; CSSL31 = AN31" name="" value="0x1" />
         <value caption="Skip AN31 for input scan; CSSL31 = AN31" name="" value="0x0" />
      </value-group>
      <value-group caption="AN32 Pin Scan Selection bits" name="AD1CSSL2__CSSL32">
         <value caption="Select AN32 for input scan; CSSL32 = AN32" name="" value="0x1" />
         <value caption="Skip AN32 for input scan; CSSL32 = AN32" name="" value="0x0" />
      </value-group>
      <value-group caption="AN33 Pin Scan Selection bits" name="AD1CSSL2__CSSL33">
         <value caption="Select AN33 for input scan; CSSL33 = AN33" name="" value="0x1" />
         <value caption="Skip AN33 for input scan; CSSL33 = AN33" name="" value="0x0" />
      </value-group>
      <value-group caption="AN34 Pin Scan Selection bits" name="AD1CSSL2__CSSL34">
         <value caption="Select AN34 for input scan; CSSL34 = AN34" name="" value="0x1" />
         <value caption="Skip AN34 for input scan; CSSL34 = AN34" name="" value="0x0" />
      </value-group>
      <value-group caption="AN35 Pin Scan Selection bits" name="AD1CSSL2__CSSL35">
         <value caption="Select AN35 for input scan; CSSL35 = AN35" name="" value="0x1" />
         <value caption="Skip AN35 for input scan; CSSL35 = AN35" name="" value="0x0" />
      </value-group>
      <value-group caption="AN36 Pin Scan Selection bits" name="AD1CSSL2__CSSL36">
         <value caption="Select AN36 for input scan; CSSL36 = AN36" name="" value="0x1" />
         <value caption="Skip AN36 for input scan; CSSL36 = AN36" name="" value="0x0" />
      </value-group>
      <value-group caption="AN37 Pin Scan Selection bits" name="AD1CSSL2__CSSL37">
         <value caption="Select AN37 for input scan; CSSL37 = AN37" name="" value="0x1" />
         <value caption="Skip AN37 for input scan; CSSL37 = AN37" name="" value="0x0" />
      </value-group>
      <value-group caption="AN38 Pin Scan Selection bits" name="AD1CSSL2__CSSL38">
         <value caption="Select AN38 for input scan; CSSL38 = AN38" name="" value="0x1" />
         <value caption="Skip AN38 for input scan; CSSL38 = AN38" name="" value="0x0" />
      </value-group>
      <value-group caption="AN39 Pin Scan Selection bits" name="AD1CSSL2__CSSL39">
         <value caption="Select AN39 for input scan; CSSL39 = AN39" name="" value="0x1" />
         <value caption="Skip AN39 for input scan; CSSL39 = AN39" name="" value="0x0" />
      </value-group>
      <value-group caption="AN40 Pin Scan Selection bits" name="AD1CSSL2__CSSL40">
         <value caption="Select AN40 for input scan; CSSL40 = AN40" name="" value="0x1" />
         <value caption="Skip AN40 for input scan; CSSL40 = AN40" name="" value="0x0" />
      </value-group>
      <value-group caption="AN41 Pin Scan Selection bits" name="AD1CSSL2__CSSL41">
         <value caption="Select AN41 for input scan; CSSL41 = AN41" name="" value="0x1" />
         <value caption="Skip AN41 for input scan; CSSL41 = AN41" name="" value="0x0" />
      </value-group>
      <value-group caption="AN42 Pin Scan Selection bits" name="AD1CSSL2__CSSL42">
         <value caption="Select AN42 for input scan; CSSL42 = AN42" name="" value="0x1" />
         <value caption="Skip AN42 for input scan; CSSL42 = AN42" name="" value="0x0" />
      </value-group>
      <value-group caption="AN43 Pin Scan Selection bits" name="AD1CSSL2__CSSL43">
         <value caption="Select AN43 for input scan; CSSL43 = AN43" name="" value="0x1" />
         <value caption="Skip AN43 for input scan; CSSL43 = AN43" name="" value="0x0" />
      </value-group>
      <value-group caption="AN44 Pin Scan Selection bits" name="AD1CSSL2__CSSL44">
         <value caption="Select AN44 for input scan; CSSL44 = AN44" name="" value="0x1" />
         <value caption="Skip AN44 for input scan; CSSL44 = AN44" name="" value="0x0" />
      </value-group>
      <value-group caption="AN45 Pin Scan Selection bits" name="AD1CSSL2__CSSL45">
         <value caption="Select AN45 for input scan; CSSL45 = AN45" name="" value="0x1" />
         <value caption="Skip AN45 for input scan; CSSL45 = AN45" name="" value="0x0" />
      </value-group>
      <value-group caption="AN46 Pin Scan Selection bits" name="AD1CSSL2__CSSL46">
         <value caption="Select AN46 for input scan; CSSL46 = AN46" name="" value="0x1" />
         <value caption="Skip AN46 for input scan; CSSL46 = AN46" name="" value="0x0" />
      </value-group>
      <value-group caption="AN47 Pin Scan Selection bits" name="AD1CSSL2__CSSL47">
         <value caption="Select AN47 for input scan; CSSL47 = AN47" name="" value="0x1" />
         <value caption="Skip AN47 for input scan; CSSL47 = AN47" name="" value="0x0" />
      </value-group>
      <value-group caption="IVREF Pin Scan Selection bits" name="AD1CSSL2__CSSL48">
         <value caption="Select IVREF for input scan; CSSL48 = IVREF" name="" value="0x1" />
         <value caption="Skip IVREF for input scan; CSSL48 = IVREF" name="" value="0x0" />
      </value-group>
      <value-group caption="CTMUT Pin Scan Selection bits" name="AD1CSSL2__CSSL49">
         <value caption="Select CTMUT for input scan; CSSL49 = CTMUT" name="" value="0x1" />
         <value caption="Skip CTMUT for input scan; CSSL49 = CTMUT" name="" value="0x0" />
      </value-group>
      <value-group caption="CTMUI Pin Scan Selection bits" name="AD1CSSL2__CSSL50">
         <value caption="Select CTMUI for input scan; CSSL50 = CTMUI" name="" value="0x1" />
         <value caption="Skip CTMUI for input scan; CSSL50 = CTMUI" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00747" name="BMX" version="1">
      <register-group name="BMX">
         <register caption="Bus Matrix Configuration Register" name="BMXCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Bus Matrix Arbitration Mode bits" mask="0x00000007" name="BMXARB" values="BMXCON__BMXARB" />
            <bitfield caption="CPU Instruction or Data Access from Data RAM Wait State bit" mask="0x00000040" name="BMXWSDRM" values="BMXCON__BMXWSDRM" />
            <bitfield caption="Bus Error from CPU Instruction Access bit" mask="0x00010000" name="BMXERRIS" values="BMXCON__BMXERRIS" />
            <bitfield caption="Bus Error from CPU Data Access bit" mask="0x00020000" name="BMXERRDS" values="BMXCON__BMXERRDS" />
            <bitfield caption="Bus Error from DMA bit" mask="0x00040000" name="BMXERRDMA" values="BMXCON__BMXERRDMA" />
            <bitfield caption="Enable Bus Error from ICD Debug Unit bit" mask="0x00080000" name="BMXERRICD" values="BMXCON__BMXERRICD" />
            <bitfield caption="Enable Bus Error from IXI bit" mask="0x00100000" name="BMXERRIXI" values="BMXCON__BMXERRIXI" />
            <bitfield caption="BMX PFM Cacheability for DMA Accesses bit" mask="0x04000000" name="BMXCHEDMA" values="BMXCON__BMXCHEDMA" />
         </register>
         <register caption="Data RAM Kernel Program Base Address Register" name="BMXDKPBA" offset="0x10" rw="RW" size="4">
            <bitfield caption="DRM Kernel Program Base Address bits (bits 15-10, bits 9-0 are read only)" mask="0xFFFFFFFF" name="BMXDKPBA" values="BMXDKPBA__BMXDKPBA" />
         </register>
         <register caption="Data RAM User Data Base Address Register" name="BMXDUDBA" offset="0x20" rw="RW" size="4">
            <bitfield caption="DRM User Data Base Address bits (bits 15-10, bits 9-0 are read only)" mask="0xFFFFFFFF" name="BMXDUDBA" values="BMXDUDBA__BMXDUDBA" />
         </register>
